README.org
#+title: Evolution Strategies at the Hyperscale
#+description: General ML Training Made as Fast and Easy as Inference
#+KEYWORDS: homepage, website, research, AI
#+LANGUAGE:  en
#+OPTIONS: email:t toc:nil num:nil html-postamble:nil html-style:nil title:nil \n:t H:3
#+startup: inlineimages
#+EXPORT_FILE_NAME: index

#+HTML_HEAD: <link rel="icon" type="image/x-icon" href="imgs/favicon.ico">
#+PROPERTY:  header-args :eval never-export
#+INCLUDE: "utils/header.org"

@@html:<div class="row"><h2 class="col-md-12 text-center"><strong><font size="+4r">@@  Evolution Strategies at the Hyperscale  @@html:</font></strong></h2></div>@@


#+html: <div class="row"> <div class="col-md-12 text-center">
#+attr_html: :class list-inline
- Bidipta Sarkar*
- Mattie Fellows*
- Juan Agustin Duque*
- Alistair Letcher$^\dagger$
- Antonio León Villares$^\dagger$
- Anya Sims$^\dagger$
- Dylan Cope$^\dagger$
- Jarek Liesen$^\dagger$
- Lukas Seier$^\dagger$
- Theo Wolf$^\dagger$
- Uljad Berdica$^\dagger$
- Alexander D. Goldie
- Aaron Courville
- Karin Sevegnani
- Shimon Whiteson*
- Jakob Nicolaus Foerster*
#+html: </div> </div>


#+html: <div class="row"> <div class="col-md-12 text-center">
#+attr_html: :class list-inline
- @@html:<image src="imgs/oxford_logo.png" height="48px">@@
- @@html:<image src="imgs/flair_logo.png" height="48px">@@
- @@html:<image src="imgs/whirl_logo.png" height="48px">@@
- @@html:<image src="imgs/mila_logo.png" height="48px">@@
- @@html:<image src="imgs/nvidia_logo.png" height="48px">@@
#+html: </div> </div>


# #+html: <div class="row"> <div class="col-md-12 text-center"><font size="+2">
# #+attr_html: :class list-inline
# - Conference Name
# #+html: </font></div> </div>


#+html: <div class="row"> <div class="col-md-4 col-md-offset-4 text-center">
#+attr_html: :class nav nav-pills nav-justified
- @@html:<a href="https://arxiv.org"><image src="imgs/thumbnail.jpg" height="60px"><h4><strong>Paper</strong></h4></a>@@
- @@html:<a href="https://github.com/EasyAcademicWebsite/EasyAcademicWebsite.github.io"><image src="imgs/GitHub-Mark.png" height="60px"><h4><strong>Code</strong></h4></a>@@
- @@html:<a href="https://huggingface.co"><image src="imgs/huggingface.svg" height="60px"><h4><strong>Models</strong></h4></a>@@
#+html: </div></div>

#+html: <div class="row"> <div class="col-md-8 col-md-offset-2">

# #+begin_export html
# <div style="position:relative;padding-top:56.25%;">
#     <iframe src="https://www.youtube.com/embed/aKydtOXW8mI" width="560" height="315" allowfullscreen style="position:absolute;top:0;left:0;width:100%;height:100%;"></iframe>
# </div>
# #+end_export


* 

** 

We developed a new hardware-efficient algorithm for evolutionary strategies, making it many orders of magnitude faster than OpenES and 3 times faster than RL. In fact, we bring the barrier of fine-tuning down to the level of inference; i.e. if you can do (batch) inference of a system and evaluate the fitness of the system, you can optimize it with our method with only a 10 to 20% slowdown and no extra VRAM. This makes it an extremely practical method for general ML training, LLM fine-tuning, and optimizing effectively any end-to-end system of neural networks.

Read our blog post (add link) for more details.




#+html: </div></div>

#+html:</div></div></div>


# #+begin_export html
# <div class="row"><div class="col-md-8 col-md-offset-2">
# <h3>Citation</h3>
# <div class="form-group col-md-10 col-md-offset-1"><textarea id="bibtex" class="form-control" readonly>
# @inproceedings{NameYearTitle,
# 	title={Easy Academic Website Template},
# 	author={Your Name and Coauthor Name},
# 	booktitle={Conference Name},
# 	year={This Year}
# }</textarea>
# </div></div>
# #+end_export

#+begin_export html	  
</div>
<div class="row"><div class="col-md-8 col-md-offset-2"><p class="text-justify">
<br><br>
The website template was borrowed from <a href="http://easyacademicwebsite.github.io">Easy Academic Website Template</a> and <a href="http://jonbarron.info/">Jon Barron</a>
</p></div></div>
#+end_export

# Local Variables:
# eval: (add-hook 'after-save-hook (lambda nil (when (y-or-n-p "Tangle?") (org-html-export-to-html))) nil t)
# End:
